const withLimition = [
    '۲ کاربر، ۲۰ گیگ: ۷۰ تومن ( بسته پایه )',
    '۴ کاربر، ۲۰ گیگ: ۷۵ تومن ( بسته پایه - خانواده )',
    '۲ کاربر، ۴۰ گیگ: ۸۵ تومن ( پکیج نقره )',
    '۴ کاربر، ۴۰ گیگ: ۹۵ تومن ( پکیج نقره - خانواده )',
    '۲ کاربر، ۶۰ گیگ: ۱۰۵ تومن ( بسته اقتصادی - طلا )',
    '۴ کاربر، ۶۰ گیگ: ۱۱۰ تومن ( بسته اقتصادی‌طلایی- خانواده )',
    '۲ کاربر، ۱۰۰ گیگ: ۱۵۰ تومن ( بسته کاربردی - الماس )',
    '۴ کاربر، ۱۰۰گیگ: ۱۶۵ تومن ( بسته کاربردی‌الماسی - خانواده )',
    '۲ کاربر، ۲۰۰ گیگ: ۲۷۰ تومن ( بسته توسعه‌دهندگان )',
    '۴ کاربر، ۲۰۰ گیگ ۲۹۰ تومن ( بسته توسعه‌دهندگان - خانواده )',
    'بازگشت'
]
const buyWithLimition = [
    'https://zarinp.al/493356',
    '۴ کاربر، ۲۰ گیگ: ۷۵ تومن ( بسته پایه - خانواده )',
    '۲ کاربر، ۴۰ گیگ: ۸۵ تومن ( پکیج نقره )',
    '۴ کاربر، ۴۰ گیگ: ۹۵ تومن ( پکیج نقره - خانواده )',
    '۲ کاربر، ۶۰ گیگ: ۱۰۵ تومن ( بسته اقتصادی - طلا )',
    '۴ کاربر، ۶۰ گیگ: ۱۱۰ تومن ( بسته اقتصادی‌طلایی- خانواده )',
    '۲ کاربر، ۱۰۰ گیگ: ۱۵۰ تومن ( بسته کاربردی - الماس )',
    '۴ کاربر، ۱۰۰گیگ: ۱۶۵ تومن ( بسته کاربردی‌الماسی - خانواده )',
    '۲ کاربر، ۲۰۰ گیگ: ۲۷۰ تومن ( بسته توسعه‌دهندگان )',
    '۴ کاربر، ۲۰۰ گیگ ۲۹۰ تومن ( بسته توسعه‌دهندگان - خانواده )',
    'بازگشت'
]
const unlimited = [
    '۲۰ گیگ: ۹۰ تومن ( بسته پایه )',
    '۴۰ گیگ: ۱۱۵ تومن ( پکیج نقره )',
    '۶۰ گیگ: ۱۳۰ تومن ( بسته اقتصادی - طلا )',
    '۱۰۰ گیگ: ۱۷۵ تومن ( بسته کاربردی - الماس )',
    '۲۰۰ گیگ: ۳۱۰ تومن ( بسته توسعه‌دهندگان )',
    'بازگشت'
]

module.exports = {
    withLimition,
    unlimited,
    buyWithLimition
}